/* REXX ************************************************************** *
 *      LET THE BREXX/370 HAVE A NICE ABEND                            *
 * ******************************************************************* */
ABEND(42)
