say copies('-',60)
say "Date Time Functions"
say copies('-',60)
    s1=datetime('T')
    s2=datetime('E',s1,'T')
    say "DateTime stamp of today: "s1
    say "DateTime re-converted:   "s2
