/* ---------------------------------------------------------------------
 * Report Version Information and Build Date of BREXX
 * ---------------------------------------------------------------------
 */
say version()
say version('FULL')
