/* REXX ************************************************************** *
 *      LET THE BREXX/370 HAVE A TALK                                  *
 * ******************************************************************* */
CALL WTO('The Ultimate Answer to Life, The Universe and Everything is...42!')
