        say copies('-',60)
        say "Create an Integer Array"
        say copies('-',60)
        i1=Icreate(100,"DENUMERATE")
        say iarray(i1)
        call ilist(i1,,,'Denumerated Integer Array')
