/* ---------------------------------------------------------------------
 * LISTNCAT find all Datasets which are not catalogued (by VTOCs)
 * ---------------------------------------------------------------------
 */
call lstnCAT arg(1)
