/* ---------------------------------------------------------------------
 * LISTALL  find all Datasets of the MVS Environment (by VTOCs)
 * ---------------------------------------------------------------------
 */
call lstall arg(1)
