/* BREXX */
/* -----------------------------------------------------------------------------
 * Example:  List VTOC
 *                                                                PEJ 31.12.2022
 * -----------------------------------------------------------------------------
 */
 call vtoc arg(1),'LIST'
