/* ------------------------------------------------------------------
 * STOP MASTER TRACE TABLE SCAN
 * ------------------------------------------------------------------
 */
CALL WTO 'TTSCAN STOP'
