        /* ------------------------------------------------------------
         * Stargate Client, start Menu
         * ------------------------------------------------------------
         */
        Call STARGFSS
