        /* -------------------------------------------------------------
         * How to start a STARGATE Server
         *    rc=stargate('RECEIVE','xxx.xxx.xx',3205)
         *       Add your TCP-Address or URL
         * -------------------------------------------------------------
         */
          rc=stargate('RECEIVE','xxx.xxx.xxx',3205)
          say 'Stargate ended with RC='rc
        return
