/* ---------------------------------------------------------------------
 * Sets Sticky Header Line 2
 * ---------------------------------------------------------------------
 */
SetHDR2:
  call stdash 'header2',arg(1),arg(2)
return
