/* ---------------------------------------------------------------------
 * Sets Sticky Header Line 3
 * ---------------------------------------------------------------------
 */
SetHDR3:
  call stdash 'header3',arg(1),arg(2)
return
