/* ---------------------------------------------------------------------
 * Sets Sticky Header Line
 * ---------------------------------------------------------------------
 */
SetHDR:
  call stdash 'header',arg(1),arg(2),arg(3)
return
