/* ---------------------------------------------------------------------
 * Sets Sticky Info Message
 * ---------------------------------------------------------------------
 */
SetInfo:
  call stdash 'INFO',arg(1),arg(2)
return
