/* ---------------------------------------------------------------------
 * Sets Sticky POP Message
 * ---------------------------------------------------------------------
 */
SetPOP1:
  call stdash 'POP1',arg(1),arg(2)
return
