/* ---------------------------------------------------------------------
 * Sets Sticky Error Message
 * ---------------------------------------------------------------------
 */
SetMSG:
  call stdash 'SMSG',arg(1),arg(2)
return
