/* ---------------------------------------------------------------------
 * Copy stem into SORTIN. stem
 * .............................. Created by PeterJ on 15. December 2018
 * ---------------------------------------------------------------------
 */
sortcopy:
call stemcopy(arg(1),'SORTIN.')
return sortin.0
