.* -------------------------------------------------------------------- 00027700
.*       END OF WORK AREA DEFINITON                                     00027800
.* -------------------------------------------------------------------- 00027900
         MACRO                                                          00028000
&LABEL   WORKEND                                                        00028100
         DS  CL256                                                      00028200
WORKLEN  EQU *-WORKAREA                                                 00028300
         MEND                                                           00028400
